# Versicherung on Paper

In [ ]:
%load_ext sql

In [ ]:
%sql mysql://steinam:steinam@localhost/versicherung_complete

-	Gesucht wird eine wiederholungsfreie Liste der Herstellerländer			3 P

In [5]:
%%sql 
-- meine Lösung

select distinct(Land) from Fahrzeughersteller;

5 rows affected.

[('Deutschland',), ('Schweden',), (None,), ('Frankreich',), ('',)]

In [125]:
%%sql
-- deine Lösung
select fahrzeughersteller.Land 
from fahrzeughersteller 
group by fahrzeughersteller.Land 
;

5 rows affected.

[(None,), ('',), ('Deutschland',), ('Frankreich',), ('Schweden',)]

- Listen Sie alle Fahrzeugtypen und die Anzahl Fahrzeuge dieses Typs, aber nur, wenn mehr als 2 Fahrzeuge des Typs vorhanden sind. Sortieren Sie die Ausgabe nach Fahrzeugtypen.	4 P

In [18]:
%%sql
-- meine Lösung
select fahrzeugtyp.Bezeichnung, count(fahrzeug.iD) as Anzahl
from fahrzeugtyp left join fahrzeug
on fahrzeugtyp.id = fahrzeug.fahrzeugtyp_id
group by fahrzeugtyp.bezeichnung
having count(Anzahl) > 2

1 rows affected.

[('Corsa', 3)]

In [126]:
%%sql
select fahrzeugtyp.*,
	(Select sum(fahrzeug.ID) from fahrzeug) as Anzahl
from fahrzeugtyp
order by fahrzeugtyp.ID
having Anzahl > 2;

(_mysql_exceptions.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'having Anzahl > 2' at line 5") [SQL: 'select fahrzeugtyp.*,\n\t(Select sum(fahrzeug.ID) from fahrzeug) as Anzahl\nfrom fahrzeugtyp\norder by fahrzeugtyp.ID\nhaving Anzahl > 2;']

- Ermittle die Namen und Vornamen der Mitarbeiter incl. Abteilungsname, deren Abteilung ihren Sitz in Dortmund oder Bochum hat.

In [139]:
%%sql
-- meine Lösung

-- select ID from Abteilung where Abteilung.Ort = 'Dortmund' or abteilung.Ort =  'Bochum'


select Name, vorname, Bezeichnung, Abteilung.ID, Mitarbeiter.Abteilung_ID from Mitarbeiter inner join Abteilung 
on Mitarbeiter.Abteilung_ID = Abteilung.ID 
where Abteilung.Ort in('Dortmund', 'Bochum')

14 rows affected.

[('Müller', 'Kurt', 'Finanzbuchhaltung', 1, 1),
 ('Schneider', 'Daniela', 'Finanzbuchhaltung', 1, 1),
 ('Meyer', 'Walter', 'Anlagenbuchhaltung', 2, 2),
 ('Schmitz', 'Michael', 'Anlagenbuchhaltung', 2, 2),
 ('Wagner', 'Gaby', 'Kostenrechnung', 3, 3),
 ('Feyerabend', 'Werner', 'Kostenrechnung', 3, 3),
 ('Langmann', 'Matthias', 'Kostenplanung', 4, 4),
 ('Peters', 'Michael', 'Kostenplanung', 4, 4),
 ('Aagenau', 'Karolin', 'Lagerhaltung', 6, 6),
 ('Pinkart', 'Petra', 'Lagerhaltung', 6, 6),
 ('Olschewski', 'Pjotr', 'Produktion', 7, 7),
 ('Nordmann', 'Jörg', 'Produktion', 7, 7),
 ('Carlsen', 'Zacharias', 'Forschung und Entwicklung', 12, 12),
 ('Baber', 'Yvonne', 'Forschung und Entwicklung', 12, 12)]

In [144]:
%%sql
-- deine Lösung
Select mitarbeiter.Name,
	mitarbeiter.Vorname,
	(Select abteilung.Bezeichnung from abteilung where abteilung.ID = mitarbeiter.Abteilung_ID) as Abteilung
from mitarbeiter
where mitarbeiter.Abteilung_ID in(Select abteilung.ID from abteilung where abteilung.Ort = 'Dortmung' or abteilung.Ort = 'Bochum');

6 rows affected.

[('Aagenau', 'Karolin', 'Lagerhaltung'),
 ('Pinkart', 'Petra', 'Lagerhaltung'),
 ('Olschewski', 'Pjotr', 'Produktion'),
 ('Nordmann', 'Jörg', 'Produktion'),
 ('Carlsen', 'Zacharias', 'Forschung und Entwicklung'),
 ('Baber', 'Yvonne', 'Forschung und Entwicklung')]

- Gesucht wird für jeden Fahrzeughersteller (Angabe der ID reicht) und jedes Jahr die kleinste und größte Schadenshöhe. 
Geben Sie falls möglich auch die Differenz zwischen den beiden Werten mit in der jeweiligen Ergebnismenge aus. Ansonsten erzeugen Sie für diese Aufgabe ein eigenes sql-Statement.										5 P

In [84]:
%%sql

-- meine Lösung
select fahrzeughersteller.id, year(datum) as Jahr, min(zuordnung_sf_fz.schadenshoehe), max(zuordnung_sf_fz.Schadenshoehe), 
(max(zuordnung_sf_fz.schadenshoehe) - min(zuordnung_sf_fz.schadenshoehe)) as Differenz
from fahrzeughersteller left join fahrzeugtyp 
    on fahrzeughersteller.id = fahrzeugtyp.hersteller_ID
inner join fahrzeug on fahrzeugtyp.id = fahrzeug.fahrzeugtyp_id
    inner join zuordnung_sf_fz
        on fahrzeug.id = zuordnung_sf_fz.fahrzeug_id
    inner join schadensfall on schadensfall.id = zuordnung_sf_fz.schadensfall_id
group by fahrzeughersteller.id, year(datum)

11 rows affected.

[(2, 2007, Decimal('1234.50'), Decimal('1234.50'), Decimal('0.00')),
 (2, 2008, Decimal('1234.50'), Decimal('1251.50'), Decimal('17.00')),
 (2, 2009, Decimal('2653.40'), Decimal('2653.40'), Decimal('0.00')),
 (3, 2007, Decimal('2276.85'), Decimal('2276.85'), Decimal('0.00')),
 (7, 2008, Decimal('731.50'), Decimal('731.50'), Decimal('0.00')),
 (9, 2007, Decimal('852.00'), Decimal('852.00'), Decimal('0.00')),
 (9, 2009, Decimal('1438.75'), Decimal('1438.75'), Decimal('0.00')),
 (10, 2007, Decimal('1214.00'), Decimal('1214.00'), Decimal('0.00')),
 (10, 2008, Decimal('1983.00'), Decimal('1983.00'), Decimal('0.00')),
 (10, 2009, Decimal('865.00'), Decimal('865.00'), Decimal('0.00')),
 (11, 2007, Decimal('1438.75'), Decimal('1438.75'), Decimal('0.00'))]

In [148]:
%%sql

select fahrzeughersteller.ID,
	(select Year(Datum) from schadensfall) as Jahr,
	(select min(zuordnung_sf_fz.Schadenshoehe) from zuordnung_sf_fz 
		where Year(Datum) = Jahr 
		and zuordnung_sf_fz.Fahrzeug_ID 
			in(select fahrzeug.ID from fahrzeug where fahrzeug.Fahrzeugtyp_ID 
				in(Select fahrzeugtyp.ID from fahrzeugtyp where fahrzeugtyp.Hersteller_ID = fahrzeughersteleler.ID))) as Min_Wert,
	(select max(zuordnung_sf_fz.Schadenshoehe) from zuordnung_sf_fz 
		where schadensfall.Year(Datum) = Jahr 
		and zuordnung_sf_fz.Fahrzeug_ID 
			in(select fahrzeug.ID from fahrzeug where fahrzeug.Fahrzeugtyp_ID 
			in(Select fahrzeugtyp.ID from fahrzeugtyp where fahrzeugtyp.Hersteller_ID = fahrzeughersteller.ID))) as Max_Wert,
	(Max_Wert - Min_Wert) as Differenz
from fahrzeughersteller;

(_mysql_exceptions.OperationalError) (1054, "Unknown column 'Datum' in 'where clause'") [SQL: 'select fahrzeughersteller.ID,\n\t(select Year(Datum) from schadensfall) as Jahr,\n\t(select min(zuordnung_sf_fz.Schadenshoehe) from zuordnung_sf_fz \n\t\twhere Year(Datum) = Jahr \n\t\tand zuordnung_sf_fz.Fahrzeug_ID \n\t\t\tin(select fahrzeug.ID from fahrzeug where fahrzeug.Fahrzeugtyp_ID \n\t\t\t\tin(Select fahrzeugtyp.ID from fahrzeugtyp where fahrzeugtyp.Hersteller_ID = fahrzeughersteleler.ID))) as Min_Wert,\n\t(select max(zuordnung_sf_fz.Schadenshoehe) from zuordnung_sf_fz \n\t\twhere schadensfall.Year(Datum) = Jahr \n\t\tand zuordnung_sf_fz.Fahrzeug_ID \n\t\t\tin(select fahrzeug.ID from fahrzeug where fahrzeug.Fahrzeugtyp_ID \n\t\t\tin(Select fahrzeugtyp.ID from fahrzeugtyp where fahrzeugtyp.Hersteller_ID = fahrzeughersteller.ID))) as Max_Wert,\n\t(Max_Wert - Min_Wert) as Differenz\nfrom fahrzeughersteller;']

- Zeige alle Mitarbeiter und deren Autokennzeichen, die als Dienstwagen einen Opel fahren. 
											4 P

In [153]:
%%sql
select Mitarbeiter.Name, dienstwagen.Kennzeichen
from Mitarbeiter inner join dienstwagen
on mitarbeiter.id = dienstwagen.Mitarbeiter_id
inner join fahrzeugtyp 
    on dienstwagen.fahrzeugtyp_Id = fahrzeugtyp.id
    inner join fahrzeughersteller
        on fahrzeugtyp.hersteller_id = fahrzeughersteller.id
where Fahrzeughersteller.NAme = 'Opel'

2 rows affected.

[('Kalman', 'DO-WB 354'), ('Kolic', 'DO-WB 384')]

In [155]:
%%sql
-- deine Lösung
/*
Select mitarbeiter.*,
	(select dienstwagen.Kennzeichen from dienstwagen 
     where mitarbeiter.ID = dienstwagen.Mitarbeiter_ID) as Kennzeichen
from mitarbeiter
where mitarbeiter.ID in 
    (
*/
 Select dienstwagen.Mitarbeiter_ID from dienstwagen 
        where dienstwagen.Fahrzeugtyp_ID = (Select fahrzeugtyp.ID from fahrzeugtyp 
                                                 where fahrzeugtyp.Bezeichnung = 'Opel');

0 rows affected.

[]

- Welche Fahrzeuge haben Schäden verursacht, deren Schadenssumme höher als die durchschnittliche Schadenshöhe sind.							5 P

In [28]:
%%sql

select fahrzeug.kennzeichen, sum(schadenshoehe)
from fahrzeug inner join zuordnung_sf_fz
on fahrzeug.id = zuordnung_sf_fz.fahrzeug_id
group by fahrzeug.kennzeichen
having sum(schadenshoehe) > (select avg(schadenshoehe) from zuordnung_sf_fz)

6 rows affected.

[('BO-GH 102', Decimal('2290.75')),
 ('GE-AB 123', Decimal('1438.75')),
 ('K-XR 147', Decimal('2276.85')),
 ('RE-CD 456', Decimal('3197.00')),
 ('RE-LM 902', Decimal('2486.00')),
 ('RE-LM 903', Decimal('2653.40'))]

In [156]:
%%sql

-- deine Lösung
select fahrzeug.*
from fahrzeug
having fahrzeug.ID in(select zuordnung_sf_fz.Fahrzeug_ID from zuordnung_sf_fz 
                      where zuordnung_sf_fz.schadenshoehe > AVG(zuordnung_sf_fz.schadenshoehe));

(_mysql_exceptions.ProgrammingError) (1111, 'Invalid use of group function') [SQL: '-- deine Lösung\nselect fahrzeug.*\nfrom fahrzeug\nhaving fahrzeug.ID in(select zuordnung_sf_fz.Fahrzeug_ID from zuordnung_sf_fz where zuordnung_sf_fz.schadenshoehe > AVG(zuordnung_sf_fz.schadenshoehe));']

- Welche Mitarbeiter sind älter als das Durchschnittsalter der Mitarbeiter.		4 P

In [65]:
%%sql

select Mitarbeiter.Name, Mitarbeiter.Geburtsdatum
from Mitarbeiter
where Geburtsdatum < (select avg(Geburtsdatum) from Mitarbeiter ma)   
order by Mitarbeiter.Name

13 rows affected.

[('Aagenau', datetime.date(1950, 1, 2)),
 ('Aliman', datetime.date(1965, 11, 12)),
 ('Baber', datetime.date(1957, 10, 2)),
 ('Braun', datetime.date(1966, 9, 5)),
 ('Carlsen', datetime.date(1965, 9, 29)),
 ('Langer', datetime.date(1968, 1, 13)),
 ('Meyer', datetime.date(1963, 7, 2)),
 ('Nordmann', datetime.date(1959, 7, 8)),
 ('Olschewski', datetime.date(1956, 5, 6)),
 ('Pinkart', datetime.date(1953, 3, 4)),
 ('Polovic', datetime.date(1961, 11, 26)),
 ('Schindler', datetime.date(1962, 9, 10)),
 ('Schmitz', datetime.date(1959, 8, 25))]

In [49]:
%%sql
-- geht auch
select ma.Name, ma.Geburtsdatum
from Mitarbeiter ma
where (now() - ma.Geburtsdatum) < (now() - (select avg(geburtsdatum) from mitarbeiter))
order by ma.Name;

15 rows affected.

[('Deiters', datetime.date(1989, 8, 26)),
 ('Eggert', datetime.date(1986, 7, 23)),
 ('Feyerabend', datetime.date(1982, 4, 1)),
 ('Friedrichsen', datetime.date(1983, 6, 20)),
 ('Grosser', datetime.date(1980, 5, 17)),
 ('Hinkel', datetime.date(1977, 4, 16)),
 ('Janssen', datetime.date(1974, 3, 15)),
 ('Kalman', datetime.date(1976, 12, 17)),
 ('Kolic', datetime.date(1971, 2, 14)),
 ('Langmann', datetime.date(1976, 3, 28)),
 ('Müller', datetime.date(1977, 1, 5)),
 ('Peters', datetime.date(1973, 11, 15)),
 ('Pohl', datetime.date(1980, 10, 27)),
 ('Schneider', datetime.date(1980, 2, 16)),
 ('Wagner', datetime.date(1970, 1, 18))]

In [160]:
%%sql
-- deine Lösung

select mitarbeiter.*
from mitarbeiter
where mitarbeiter.Geburtsdatum < (select AVG(mitarbeiter.Geburtsdatum) from mitarbeiter);

13 rows affected.

[(3, '20001', 'Meyer', 'Walter', datetime.date(1963, 7, 2), '0231/5553967', None, 'walter.meyer@unserefirma.de', '212', 'J', 2, 'M'),
 (4, '20002', 'Schmitz', 'Michael', datetime.date(1959, 8, 25), '0231/5556187', None, 'michael.schmitz@unserefirma.de', '212', 'N', 2, 'M'),
 (10, '50002', 'Braun', 'Christian', datetime.date(1966, 9, 5), '0201/4014726', '(0170) 8351647', 'christian.braun@unserefirma.de', '153', 'N', 5, 'M'),
 (11, '50003', 'Polovic', 'Frantisek', datetime.date(1961, 11, 26), '0201/4014727', '(0161) 5124793', 'frantisek.polovic@unserefirma.de', '154', 'N', 5, 'M'),
 (13, '60001', 'Aagenau', 'Karolin', datetime.date(1950, 1, 2), '0234/66006001', None, 'Karolin.Aagenau@unserefirma.de', '48', 'J', 6, 'W'),
 (14, '60002', 'Pinkart', 'Petra', datetime.date(1953, 3, 4), '0234/66006002', None, 'Petra.Pinkart@unserefirma.de', '43', 'N', 6, 'W'),
 (15, '70001', 'Olschewski', 'Pjotr', datetime.date(1956, 5, 6), '0234/66007001', None, 'Pjotr.Olschewski@unserefirma.de', '28', 'J', 7, 'M'),
 (16, '70002', 'Nordmann', 'Jörg', datetime.date(1959, 7, 8), '0234/66007002', None, 'Joerg.Nordmann@unserefirma.de', '27', 'N', 7, 'M'),
 (17, '80001', 'Schindler', 'Christina', datetime.date(1962, 9, 10), '0201/4012151', '(0173) 7513901', 'Christina.Schindler@unserefirma.de', '101', 'J', 8, 'W'),
 (18, '80002', 'Aliman', 'Zafer', datetime.date(1965, 11, 12), '0201/4012161', '(0171) 9416755', 'Zafer.Aliman@unserefirma.de', '102', 'N', 8, 'M'),
 (19, '80003', 'Langer', 'Norbert', datetime.date(1968, 1, 13), '0201/4012171', '(0162) 1357902', 'Norbert.Langer@unserefirma.de', '103', 'N', 8, 'M'),
 (27, '120001', 'Carlsen', 'Zacharias', datetime.date(1965, 9, 29), '0234/66012001', None, 'Zacharias.Carlsen@unserefirma.de', '61', 'J', 12, 'M'),
 (28, '120002', 'Baber', 'Yvonne', datetime.date(1957, 10, 2), '0234/66012002', None, 'Yvonne.Baber@unserefirma.de', '62', 'N', 12, 'W')]